tutorials/addSpecificBCs-heater/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    ceiling
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    front
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    left
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    back
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    right
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    // inlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }
    hole
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    outlet
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
