tutorials/addSpecificBCs-heater/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync         false;

writeCyclicMatch  false;

patches
(
    {
        name hole;

        patchInfo
        {
            type wall;
        }

        constructFrom set;
        set hole;
    }
    // {
    //     name outlet;

    //     patchInfo
    //     {
    //         type wall;
    //     }

    //     constructFrom set;
    //     set outlet;
    // }
);


// ************************************************************************* //
