tutorials/addSpecificBCs-heater/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    hole;
        type    faceSet;
        action  new;
        source  boxToFace;

        box     (0.3 0.209 0.2)(0.5 0.211 0.4);
    }
    // {
    //     name    outlet;
    //     type    faceSet;
    //     action  new;
    //     source  boxToFace;

    //     box     (0.3 0.209 0.2)(0.5 0.221 0.4);
    // }
);


// ************************************************************************* //
